tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Keep your Mac's application settings in sync
brew "mackup"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Internet file retriever
brew "wget"
# Typeface made for developers
cask "font-jetbrains-mono"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
